cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "homebrew/cask-fonts"

brew "autoconf"
brew "automake"
brew "bat"
brew "coreutils"
brew "direnv"
brew "docker-machine"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git-delta"
brew "git-flow-avh"
brew "gnupg"
brew "jq"
brew "libtool"
brew "libxslt"
brew "libyaml"
brew "lsd"
brew "mas"
brew "openssl"
brew "p7zip"
brew "packer"
brew "postgresql"
brew "pv"
brew "readline"
brew "rsync"
brew "rustup-init"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "wget"
brew "yadm"

cask "1password"
cask "adobe-creative-cloud"
cask "aerial"
cask "alfred"
cask "arq"
cask "dash"
cask "displaycal"
cask "docker"
cask "firefox"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "jettison"
cask "macdive"
cask "retrobatch"
cask "spotify"
cask "wezterm"

cask "homebrew/cask-fonts/font-source-code-pro"

mas "Amphetamine", id: 937984704
mas "Moom", id: 419330170
mas "Pixelmator Pro", id: 1289583905
